[
    {
        "strategy": "section",
        "source": "978-3-031-09839-0",
        "level": 3,
        "title": "Bayes Factor in the Investigative Setting",
        "content_length": 10391,
        "content": "Title: Bayes Factor in the Investigative Setting\nContent: While the use of the Bayes factor for evaluative purposes is rather well established in both theory and practice, the focus on investigative settings still offers much room for original developments. In many forensic settings, especially in early stages of an investigation, it may be that no potential source is available for comparison. In such situations, it will not be possible to compare characteristics observed on recovered and reference materials, as would be the case in an evaluative setting (Sect. 1.5). Nevertheless, one can derive valuable information from the recovered material alone. Consider, for example, two populations denoted \\(p_{1}\\) and \\(p_{2}\\), respectively, and the following two propositions:\n\n\\(H_{1}\\): The recovered item comes from population \\(p_{1}\\) (e.g., a population of females). \\(H_{2}\\): The recovered item comes from population \\(p_{2}\\) (e.g., a population of males).\n\nDenote by \\(y\\) the measurements on the recovered material known to belong to one of the two populations specified by the competing hypotheses, but it is not known which one. For such a situation, the Bayes factor measures the change produced by the measurements \\(y\\) on the recovered item in the odds in favor of \\(H_{1}\\), as compared to \\(H_{2}\\), when going from the prior to the posterior distribution.\n\nAssume that a parametric statistical model \\(\\{f(\\cdot\\mid\\theta),\\theta\\in\\Theta\\}\\) is suitable for the data at hand. The problem of discriminating between two populations can then be treated as a problem of comparing statistical hypotheses, assuming that the probability distribution for the measurements on the recovered material (under each hypothesis) is of a given form. Consider, first, the situation where the parameters characterizing the two populations are known, that is, \\(\\theta=\\theta_{1}\\) if the recovered item comes from population \\(p_{1}\\) and \\(\\theta=\\theta_{2}\\) if the recovered item comes from population \\(p_{2}\\). Formally, this amounts to specifying the probability distributions \\(f(y\\mid\\theta_{1})\\) and \\(f(y\\mid\\theta_{2})\\), respectively. The posterior probability of the competing propositions can be computed as in (1.5) and the Bayes factor simplifies to a ratio of likelihoods as in (1.6).\n\n_Example 1.6 (Fingermark Examination)_ Consider a case involving a single fingermark of unknown source. The fingerprint examiner seeks to help with the question of whether the mark comes from a man or woman. Thus, for investigative purposes, the following two propositions are of interest:\n\n\\[\\text{(continued)}\\]\n\n[MISSING_PAGE_FAIL:34]\n\n_Example 1.7_ (_Fingermark Examination--Continued_): Recall Example 1.6 where a Normal probability distribution was assumed for the measured ridge density on a fingermark, with variance known and equal to \\(\\sigma_{i}^{2}\\). A conjugate prior distribution may be introduced for the population mean \\(\\theta_{i}\\), say \\(\\theta_{i}\\sim\\text{N}(\\mu_{i},\\tau_{i}^{2})\\). The marginal likelihoods are still Normal with mean equal to the prior mean \\(\\mu_{i}\\) and variance equal to the sum of the prior variance \\(\\tau_{i}^{2}\\) and the population variance \\(\\sigma_{i}^{2}\\). The Bayes factor therefore is\n\n\\[\\text{BF }=\\frac{\\text{N}(y\\mid\\mu_{1},\\tau_{1}^{2}+\\sigma_{1}^{2})}{\\text{N}(y \\mid\\mu_{2},\\tau_{2}^{2}+\\sigma_{2}^{2})}.\\]\n\nThe same idea can be extended to the case where both the mean and the variance are unknown. This will be addressed in Sect. 4.3.2.\n\nThe Bayes factor thus depends on the prior _assumptions_ about parameters characterizing each population. This must not be confused, as noted earlier, with prior probabilities for competing propositions. The latter will form the prior _odds_ which will be multiplied by the Bayes factor to compute the posterior odds\n\n\\[\\frac{\\text{Pr}(H_{1}\\mid y)}{\\text{Pr}(H_{2}\\mid y)}=\\frac{f_{H_{1}}(y)}{f_{ H_{2}}(y)}\\times\\frac{\\text{Pr}(H_{1})}{\\text{Pr}(H_{2})}.\\]\n\nThe Bayesian approach for discriminating between two propositions regarding population membership can be easily generalized to the case where there are any number \\(k\\) (>2) of competing mutually exclusive propositions. Let \\(H_{1},\\ldots,H_{k}\\) denote \\(k\\) propositions and denote by \\(y\\) the observation to be evaluated. The propositions of interest can be defined as follows:\n\n\\(H_{1}\\): The recovered item comes from population 1 (\\(p_{1}\\)).\n\n\\(H_{2}\\): The recovered item comes from population 2 (\\(p_{2}\\)).\n\n\\(\\vdots\\):\n\n\\(H_{k}\\): The recovered item comes from population k (\\(p_{k}\\)).\n\n_Example 1.8_ (_Questioned Documents_): Consider a case involving questioned documents where the issue of interest is which of three printing machines has been used to print a questioned document. Propositions of interest are:\n\n\\(H_{1}\\): The questioned documents have been printed with printer 1.\n\n\\(H_{2}\\): The questioned documents have been printed with printer 2.\n\n**Example 1.8** (continued): \\(H_{3}\\): The questioned documents have been printed with printer 3.\n\nAfter having specified a Bayesian statistical model for each proposition (i.e., a probability distribution for the available measurements and a prior distribution for the unknown parameters), the marginal likelihoods \\(f_{H_{i}}(y)\\), \\(i=1,2,3\\), characterizing propositions \\(H_{1}\\), \\(H_{2}\\), and \\(H_{3}\\), can be obtained as in (1.25).\n\nOccasionally, cases involve multiple propositions. Imagine a case involving DNA findings, such as bloodstains recovered on a crime scene, with the reported profile being compared against the profile of a person of interest. The defense argues that the bloodstain does not come from the person but from either a relative (e.g., a brother) or an unknown person. A question that may arise in such a case is how to evaluate and report results, because the Bayes factor involves pairwise comparisons. One option is to report only the marginal likelihoods \\(f_{H_{i}}(y)\\), even if they may not be easy to interpret. Alternatively, one may report a scaled version \\(f^{*}_{H_{i}}(y)\\) as suggested by Berger and Pericchi (2015), that is,\n\n\\[f^{*}_{H_{i}}(y)=\\frac{f_{H_{i}}(y)}{\\sum_{j=1}^{k}f_{H_{j}}(y)}. \\tag{1.27}\\]\n\nThis expression will be much easier to interpret, because the scaled likelihoods \\(f^{*}_{H_{i}}(y)\\) sum up to 1. Generally, prior probabilities \\(\\Pr(H_{i})\\) may vary between recipients of such reports, but the posterior probability can be easily computed as\n\n\\[\\Pr(H_{i}\\mid y)=\\frac{\\Pr(H_{i})f^{*}_{H_{i}}(y)}{\\sum_{j=1}^{k}\\Pr(H_{j})f^ {*}_{H_{j}}(y)},\\qquad\\qquad i=1,\\ldots,k\\]\n\nfollowed, if required, by classification of the recovered material in the population with the highest posterior probability. Note that reporting the scaled version in (1.27) is equivalent to assuming equal prior probabilities for competing propositions. In fact, if \\(\\Pr(H_{i})=\\frac{1}{k}\\), \\(i=1,\\ldots,k\\), then it can easily be shown that\n\n\\[\\Pr(H_{i}\\mid y)=\\frac{f^{*}_{H_{i}}(y)}{\\sum_{j=1}^{k}f^{*}_{H_{j}}(y)}=f^{*} _{H_{i}}(y),\\qquad i=1,\\ldots,k,\\]\n\nas \\(\\sum_{j=1}^{k}f^{*}_{H_{j}}(y)=1\\).\n\nThe analyst may also consider the possibility of summarizing several propositions into one, in order to produce a comparison between two propositions regarding population membership. One of these propositions will be composite. Let\\(H_{2}\\cup\\cdots\\cup H_{k}\\). Starting from \\(k\\) possible populations from which the recovered material may come from, a pair of competing propositions of interest may thus be formulated as follows:\n\n\\(H_{1}\\): The recovered item comes from population 1 (\\(p_{1}\\)).\n\n\\(\\bar{H_{1}}\\): The recovered item comes from one of the other populations (\\(p_{2}\\),..., \\(p_{k}\\)).\n\nThe marginal likelihood \\(f_{H_{1}}(y)\\) characterizing proposition \\(H_{1}\\) is obtained as in (1.25), while the marginal likelihood under \\(\\bar{H_{1}}\\) is\n\n\\[f_{\\bar{H_{1}}}(y)=\\sum_{i=2}^{k}\\Pr(p_{i})\\int_{\\Theta_{i}}f(y\\mid\\theta_{i}) \\pi(\\theta_{i}\\mid p_{i})d\\theta_{i},\\]\n\nwith \\(\\sum_{i=1}^{k}\\Pr(p_{i})=1\\). The Bayes factor expressing the value of \\(y\\) for comparing \\(H_{1}\\) against \\(\\bar{H_{i}}\\) becomes\n\n\\[\\text{BF}\\ =\\frac{f_{H_{1}}(y)\\sum_{i=2}^{k}\\Pr(p_{i})}{f_{\\bar{H_{1}}}(y)}. \\tag{1.28}\\]\n\nThe posterior odds become\n\n\\[\\frac{\\Pr(H_{1}\\mid y)}{\\Pr(\\bar{H_{1}}\\mid y)}=\\frac{f_{H_{1}}(y)\\Pr(p_{1})}{ f_{\\bar{H_{1}}}(y)},\\]\n\n(Aitken et al., 2021, p. 643).\n\n_Example 1.9_ (Questioned Documents--_Continued_): Consider the following propositions:\n\n\\(H_{1}\\): The questioned documents have been printed with printer 1.\n\n\\(\\bar{H_{1}}\\): The questioned documents have been printed with printer 2 or with printer 3.\n\nThe marginal likelihood characterizing proposition \\(H_{1}\\) is\n\n\\[f_{H_{1}}(y)=\\int_{\\Theta_{1}}f(y\\mid\\theta_{1})\\pi(\\theta_{1}\\mid p_{1})d \\theta_{1}.\\]\n\nThe marginal likelihood characterizing proposition \\(\\bar{H_{1}}\\) will become\n\n\\[f_{\\bar{H_{1}}}(y)=\\Pr(p_{2})\\int_{\\Theta_{2}}f(y\\mid\\theta_{2})\\pi(\\theta_{2} \\mid p_{2})d\\theta_{2}\\] (continued)\n\n[MISSING_PAGE_EMPTY:2656]\n\nstatement about standards of evidence in scientific investigation and not a calibration of the Bayes factor (Kass, 1993). See, e.g., Ramos and Gonzalez-Rodriguez (2013), van Leeuwen and Brummer (2013) and Aitken et al. (2021) for an account of calibration as a measure of performance of BF computation methods.\n\nMoreover, it is important to note that the choice of a reported verbal equivalent is based on the magnitude of the Bayes factor and not the reverse. Marquis et al. (2016) present a discussion on how to implement a verbal scale in a forensic laboratory, considering benefits, pitfalls, and suggestions to avoid misunderstandings.\n\nIt is worth to reiterate that a Bayes factor represents _a measure of change in support_ rather than _a measure of support_, though the two expressions may be perceived as equivalent. In fact, the Bayes factor can be shown to be a non-coherent measure of support: a small Bayes factor means that the data will lower the probability of the hypothesis of interest relative to its value _prior_ to considering the evidence, but it does not imply that the probability of this hypothesis is low. The Bayes factor measures the _change_ produced in the odds, thus providing a measure of whether the available findings have increased or decreased the odds in favor of one proposition compared to the alternative (Bernardo & Smith, 2000)."
    },
    {
        "raw_response": "问题1：什么是调查设置中的贝叶斯因子（Bayes Factor）？它在什么情况下可以提供有价值的信息？\n答：调查设置中的贝叶斯因子是指在没有可以进行比较的特征来源的情况下，从被发现的材料中推导有价值信息的一种统计指标。例如，对于两个不同的群体\\(p_{1}\\)和\\(p_{2}\\)，假设\\(H_{1}\\)代表被发现物品来自群体\\(p_{1}\\)，\\(H_{2}\\)代表来自群体\\(p_{2}\\)，贝叶斯因子可以衡量观测结果\\(y\\)对\\(H_{1}\\)与\\(H_{2}\\)之间支持的变化，从先验分布向后验分布的变化。\n\n问题2：在统计假设比较中，贝叶斯因子如何与先验概率和似然函数相关联？\n答：贝叶斯因子的计算涉及到先验概率、似然函数以及参数化的统计模型。具体来说，贝叶斯因子是由似然函数的比值乘以先验概率的比值得出的，用来表示支持一个假设相对于另一个假设的证据变化程度。\n\n问题3：在贝叶斯因子的应用中，如何处理涉及多个互斥命题的情况？\n答：在有多个（大于2）互斥命题的情形下，可以应用贝叶斯因子来比较多个命题间的支持程度。对于多个命题，可以计算各自的边际似然，并据此计算后验概率。而当出现多个命题时，还可以将部分或全部提出的命题合成为一个复合命题，并通过贝叶斯因子进行比较。\n\n问题4：在贝叶斯因子计算中，如何处理不同先验概率对于结果的影响？\n答：当先验概率不同的情况下，可以通过计算缩放过的似然函数来解决。这样可以将边缘似然函数进行缩放，以消除不同先验概率对结果的影响，从而更容易进行解释和比较。\n\n问题5：贝叶斯因子的数值大小表示着什么样的信息？\n答：贝叶斯因子的数值大小表明了观测结果对于不同命题之间支持的变化程度。具体来说，贝叶斯因子是表示支持的变化而非支持的程度。其数值大小反映了观测结果是否加强了某一命题相对于另一命题的支持。\n\n问题6：在调查设置中对不同命题的评估中，贝叶斯因子如何进行标定与解释？\n答：贝叶斯因子并非直接用来评估支持的程度，而是用来评估支持的变化。因此在解释贝叶斯因子时，需要明确其代表了观测结果对命题支持的变化程度，而不是支持的绝对程度。\n\n问题7：贝叶斯因子的数值限定和语言表述相互关联吗？\n答：贝叶斯因子的数值大小并不直接决定其语言表述，而是根据其变化程度来选择合适的表述。因此，选择合适的语言表述是基于贝叶斯因子对命题支持变化的大小，而不是反过来。\n\n问题8：为什么在贝叶斯因子的计算中要考虑标准化处理？\n答：在贝叶斯因子的计算中，考虑标准化处理有助于消除不同先验概率对结果的影响，使结果更易于解释和比较。标准化处理可以使得各命题的支持程度更容易比较。\n\n问题9：贝叶斯因子如何在科学调查中的证据标准中扮演不同的角色？\n答：在科学调查中，贝叶斯因子并不是作为证据标准的一个度量标准，而是作为支持变化的度量。这表示贝叶斯因子在科学调查中不会直接决定证据的标准，而是提供用于判断证据支持变化程度的信息。\n\n问题10：在贝叶斯因子的计算中，为什么需要考虑对不同计算方法进行标定？\n答：在贝叶斯因子的计算中，考虑对不同计算方法进行标定有助于评估计算方法的性能。这可以帮助确定不同计算方法的准确性和适用性，并选择适当的计算方法。"
    }
]